# SteelElemZclipType Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..SteelElemZclipType Property
ParameterTypeId Class See Also
---
"Boundary"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId SteelElemZclipType { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property SteelElemZclipType As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ SteelElemZclipType {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace